<template>
	<div class="popup-text about" @click.stop>
		<h1 id="manual-top">Места</h1>
		<p>Версия: 6.3.3 alpha</p>
		<ol>
			<li><a href="#1-%D0%BD%D0%B0%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D0%BD%D0%B8%D0%B5">Назначение</a></li>
			<li><a
					href="#2-%D0%BA%D0%BE%D0%BD%D1%86%D0%B5%D0%BF%D1%86%D0%B8%D1%8F-%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D1%8B">
					Концепция системы</a>
				<ol>
					<li><a href="#%D1%82%D0%BE%D1%87%D0%BA%D0%B0-point">Точка (Point)</a></li>
					<li><a href="#%D0%BC%D0%B5%D1%81%D1%82%D0%BE-place">Место (Place)</a></li>
					<li><a href="#%D0%BC%D0%B0%D1%80%D1%88%D1%80%D1%83%D1%82-route">Маршрут (Route)</a></li>
					<li><a href="#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B0-folder">Папка (Folder)</a></li>
					<li><a href="#%D0%B8%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F-images">Изображения
							(Images)</a></li>
					<li><a
							href="#%D0%BD%D0%B5%D0%B7%D0%B0%D0%B2%D0%B8%D1%81%D0%B8%D0%BC%D1%8B%D0%B5-%D1%82%D0%BE%D1%87%D0%BA%D0%B8">Независимые
							точки</a></li>
					<li><a href="#%D0%B0%D0%BA%D1%82%D0%B8%D0%B2%D0%BD%D1%8B%D0%B5-%D1%82%D0%BE%D1%87%D0%BA%D0%B8">Активные
							точки</a></li>
				</ol>
			</li>
			<li><a href="#3-%D1%80%D0%B5%D0%B6%D0%B8%D0%BC%D1%8B-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B">Режимы
					работы</a>
				<ol>
					<li><a
							href="#31-%D0%BD%D0%BE%D1%80%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9-%D1%80%D0%B5%D0%B6%D0%B8%D0%BC">
							Нормальный режим</a></li>
					<li><a
							href="#32-%D1%80%D0%B5%D0%B6%D0%B8%D0%BC-%D0%BC%D0%B0%D1%80%D1%88%D1%80%D1%83%D1%82%D0%BE%D0%B2">
							Режим маршрутов</a></li>
					<li><a href="#33-%D1%80%D0%B5%D0%B6%D0%B8%D0%BC-%D0%BB%D0%B8%D0%BD%D0%B5%D0%B9%D0%BA%D0%B8">
							Режим линейки</a></li>
				</ol>
			</li>
			<li><a href="#4-%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D1%84%D0%B5%D0%B9%D1%81">Интерфейс</a>
				<ol>
					<li><a
							href="#41-%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D1%8F%D1%8F-%D0%BF%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C-%D1%88%D0%B0%D0%BF%D0%BA%D0%B0">
							Верхняя панель (шапка)</a>
						<ol>
							<li><a
									href="#411-%D0%BB%D0%B5%D0%B2%D0%B0%D1%8F-%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D1%8F%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C-%D0%BA%D0%BD%D0%BE%D0%BF%D0%BA%D0%B8-%D0%BF%D0%B5%D1%80%D0%B5%D0%BA%D0%BB%D1%8E%D1%87%D0%B0%D1%82%D0%B5%D0%BB%D0%B8">
									Левая верхняя область — кнопки-переключатели:</a></li>
							<li><a
									href="#412-%D0%BF%D1%80%D0%B0%D0%B2%D0%B0%D1%8F-%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D1%8F%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C-%D0%BA%D0%BD%D0%BE%D0%BF%D0%BA%D0%B8-%D0%B3%D0%BB%D0%BE%D0%B1%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D1%85-%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D0%B9">
									Правая верхняя область — кнопки глобальных действий:</a></li>
							<li><a
									href="#413-%D1%81%D1%80%D0%B5%D0%B4%D0%BD%D1%8F%D1%8F-%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D1%8F%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C">
									Средняя верхняя область</a></li>
						</ol>
					</li>
					<li><a
							href="#42-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D0%B0%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C">
							Основная область</a>
						<ol>
							<li><a
									href="#421-%D0%BB%D0%B5%D0%B2%D0%B0%D1%8F-%D0%BF%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C--%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D0%B0">
									Левая панель — структура</a></li>
							<li><a
									href="#422-%D0%BF%D1%80%D0%B0%D0%B2%D0%B0%D1%8F-%D0%BF%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C--%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">
									Правая панель — просмотр/редактирование</a></li>
							<li><a
									href="#423-%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C-%D0%BA%D0%B0%D1%80%D1%82%D0%B0">
									Центральная область — карта</a></li>
						</ol>
					</li>
					<li><a
							href="#43-%D0%BD%D0%B8%D0%B6%D0%BD%D1%8F%D1%8F-%D0%BF%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C-%D0%BF%D0%BE%D0%B4%D0%B2%D0%B0%D0%BB">
							Нижняя панель (подвал)</a>
						<ol>
							<li><a
									href="#431-%D0%BB%D0%B5%D0%B2%D0%B0%D1%8F-%D0%BD%D0%B8%D0%B6%D0%BD%D1%8F%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C-%D0%BA%D0%BD%D0%BE%D0%BF%D0%BA%D0%B8-%D0%BF%D0%B5%D1%80%D0%B5%D0%BA%D0%BB%D1%8E%D1%87%D0%B0%D1%82%D0%B5%D0%BB%D0%B8">
									Левая нижняя область — кнопки-переключатели:</a></li>
							<li><a
									href="#432-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D0%B0%D1%8F-%D0%BD%D0%B8%D0%B6%D0%BD%D1%8F%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C">
									Основная нижняя область</a></li>
						</ol>
					</li>
				</ol>
			</li>
			<li><a
					href="#5-%D0%BF%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF%D1%8B-%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F-%D0%B8-%D0%BF%D0%BE%D1%80%D1%8F%D0%B4%D0%BA%D0%B0">
					Принципы хранения и порядка</a>
				<ol>
					<li><a
							href="#%D1%80%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85-%D0%B8-%D0%BF%D0%BE%D1%80%D1%8F%D0%B4%D0%BA%D0%B0">Разделение
							данных и порядка</a></li>
					<li><a
							href="#%D1%8F%D0%B2%D0%BD%D0%BE%D0%B5-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B8%D0%B7%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B9">Явное
							сохранение изменений</a></li>
				</ol>
			</li>
			<li><a
					href="#6-%D0%B1%D0%B0%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9-%D1%81%D1%86%D0%B5%D0%BD%D0%B0%D1%80%D0%B8%D0%B9-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B">
					Базовый сценарий работы</a>
				<ol>
					<li><a href="#%D1%81%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5-%D0%BC%D0%B5%D1%81%D1%82%D0%B0">Создание
							места</a></li>
					<li><a
							href="#%D1%81%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5-%D0%BC%D0%B0%D1%80%D1%88%D1%80%D1%83%D1%82%D0%B0">Создание
							маршрута</a></li>
					<li><a
							href="#%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0-%D1%81-%D0%B8%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F%D0%BC%D0%B8">Работа
							с изображениями</a></li>
				</ol>
			</li>
			<li><a
					href="#7-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D0%BD%D1%8B%D0%B5-%D0%BE%D1%81%D0%BE%D0%B1%D0%B5%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8">
					Архитектурные особенности</a>
				<ol>
					<li><a
							href="#%D1%83%D0%B4%D0%B0%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B8-%D0%B1%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D1%8C-%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85">Удаление
							и безопасность данных</a></li>
					<li><a
							href="#%D0%BF%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">Принцип
							сохранения</a></li>
				</ol>
			</li>
			<li><a href="#8-%D1%82%D0%B5%D0%BA%D1%83%D1%89%D0%B8%D0%B9-%D1%81%D1%82%D0%B0%D1%82%D1%83%D1%81">
					Текущий статус</a></li>
		</ol>
		<h2 id="1-назначение">1. Назначение</h2>
		<p><strong>Места</strong> — это ГеоОрганайзер. Это персональная ГИС — инструмент для систематизации личных
			географических данных.</p>
		<p>Это не социальная сеть.
			Это не «карта с метками».
			Это не трекер перемещений.</p>
		<p>Это инструмент для осмысленного хранения и организации пространственной информации. Вы управляете не просто
			маркерами
			на карте. Вы управляете и структурируете собственные коллекции географических точек, связанных с ними мест,
			маршрутов и сопутствующих материалов в единую логическую модель.</p>
		<p><strong>Пример</strong>:
			Бар у реки, где вы периодически встречаетесь с друзьями.
			Можно сохранить саму точку на карте, добавить описание, фотографии, а затем включить её в маршрут вечерней
			прогулки.
		</p>
		<h2 id="2-концепция-системы">2. Концепция системы</h2>
		<p>В основе «Мест» лежит разделение сущностей. Их всего четыре:</p>
		<ul>
			<li><strong>Точка</strong></li>
			<li><strong>Место</strong></li>
			<li><strong>Маршрут</strong></li>
			<li><strong>Папка</strong></li>
		</ul>
		<p>Если вы понимаете разницу между ними — вы понимаете систему.</p>
		<h3 id="точка-point">Точка (Point)</h3>
		<p>Географическая координата (широта, долгота, высота).<br>
			Это чистые пространственные данные без описания.</p>
		<p>Точка — это конкретные географически координаты: широта, долгота, высота. Плюс её собственный уникальный
			идентификатор — ID.</p>
		<p>И не более того. Она не «принадлежит» месту или маршруту. Она о них даже не знает.
			Она существует сама по себе.</p>
		<p>Каждое Место связано с одной Точкой.<br>
			Маршруты состоят из последовательности Точек.</p>
		<p>Главный принцип:</p>
		<p><strong>Одна точка — одна география. Она может использоваться многократно.</strong></p>
		<h3 id="место-place">Место (Place)</h3>
		<p><strong>Смысловое описание Точки</strong>.</p>
		<p>Содержит:</p>
		<ul>
			<li>название,</li>
			<li>текстовое описание,</li>
			<li>изображения,</li>
			<li>привязку к одной конкретной Точке.</li>
		</ul>
		<p>И много ещё разной дополнительной необязательной информации, которую вы захотите добавить.</p>
		<p>При создании Места система автоматически создаёт новую Точку и «привязывает» это Место к этой точке. Эта
			техническая
			деталь скрыта от пользователя для упрощения интерфейса.</p>
		<p>Само <strong>Место не хранит географических координат</strong>. Это смысл, метаописание именно места в вашей
			жизни.
			У которого, естественно, есть и своя география (Точка).</p>
		<p><strong>Пример</strong>:
			«Беседка, в которой мы впервые поцеловались с Машей».
			Можно сохранить это место (уже с Точкой на карте), добавить описание, фотографии, а затем включить его в
			маршрут
			вечерней ностальгической прогулки.</p>
		<p>Технически же при включении Места в маршрут в этот маршрут попадает не само Место, а связанная с ним Точка.
			И таким
			образом, на одну и ту же Точку ссылаются уже две сущности: Место и Маршрут. И тут мы переходим к описанию
			Маршрутов:
		</p>
		<h3 id="маршрут-route">Маршрут (Route)</h3>
		<p><strong>Упорядоченная последовательность Точек</strong>.</p>
		<p>Особенности:</p>
		<ul>
			<li>одна и та же Точка может входить в Маршрут несколько раз;</li>
			<li>Маршрут не копирует координаты, а хранит ссылки на существующие Точки;</li>
			<li>порядок Точек имеет значение.</li>
		</ul>
		<p>Это позволяет строить как линейные маршруты, так и повторяющиеся сценарии движения.</p>
		<p><strong>Пример</strong>:
			«Вечерняя прогулка в пятницу вечером».
			Вы начинаете из дома (Точка, к которой, например, таже привязано Место «Мой дом» с фотографиями кошек
			и ободранных
			обоев), заходите в магазин купить воды (Точка), заходите в библиотеку (Точка), шатаетесь по парку (Точка,
			Точка,
			Точка…), на обратном пути опять заходите в ту же библиотеку (<strong>та же самая Точка библиотеки</strong>,
			просто
			ссылка на неё) и возвращаетесь домой (опять та же самая первая Точка, к которой до кучи привязано Место «Мой
			дом»).
			Ну, вот так провели вечер пятницы.</p>
		<h3 id="папка-folder">Папка (Folder)</h3>
		<p><strong>Иерархическая структура для организации Мест и Маршрутов</strong>.</p>
		<p>Каждая папка может содержать:</p>
		<ul>
			<li>несколько Мест или Маршрутов (в зависимости от дерева, куда входит папка),</li>
			<li>таких же вложенных папок.</li>
		</ul>
		<p>Поддерживается древовидная модель с сохранением порядка элементов. В местах есть несколько разных деревьев,
			состоящих
			из Папок — в частности, есть дерево для Мест и есть дерево для Маршрутов.</p>
		<p>На самом деле, технически, <strong>Папка не содержит в себе другие Папки, Места или Маршруты</strong>. Вся
			иерархия
			разных деревьев строится опять же по принципу «ссылок на родителя». У каждой папки есть информация, в какую
			другую
			папку она входит (просто уникальный идентификатор, ID, этой другой папки). Так же, как и у Места
			или Маршрута есть
			такая же информация, в какую Папку они входят. Но обычному пользователю об этих технических нюансах можно
			не задумываться.</p>
		<h3 id="изображения-images">Изображения (Images)</h3>
		<p><strong>Фотоальбом Места или Маршрута</strong>.</p>
		<p>Упорядоченный список загруженных вами к конкретному месту или маршруту картинок — фотографий, например.
			К тому же
			Месту «Мой дом» — подранные обои, кошки, «порядок» в кухонной раковине.</p>
		<p>Поддерживается перетаскивание (Drag &amp; Drop) для изменения порядка.</p>
		<p>Порядок изображений хранится по порядковый индексу каждого изображения, но пользователь просто видит готовый
			отсортированный список «превьюшек» этих изображений в фотоальбоме Места или Маршрута.</p>
		<p>При клике на превьюшку изображение открывается во всё окно браузера. При наведении мышки на левую и правую
			части
			изображения показываются стрелки — можно листать к предыдущей фотографии или следующей.</p>
		<h3 id="независимые-точки">Независимые точки</h3>
		<p>Независимые точки — временные маркеры. Это быстрый инструмент для планирования и эксперимента без фиксации
			данных.
		</p>
		<p>Они:</p>
		<ul>
			<li>не сохраняются в базе;</li>
			<li>существуют только в текущей сессии;</li>
			<li>могут использоваться для построения маршрутов;</li>
			<li>могут быть преобразованы в постоянные сущности (планируется).</li>
		</ul>
		<p>Это способ быстро отметить что-то на карте без создания Места.</p>
		<h3 id="активные-точки">Активные точки</h3>
		<p>В системе есть активные (текущие) сущности:</p>
		<ul>
			<li>текущее Место</li>
			<li>текущий Маршрут</li>
			<li>текущая Точка</li>
		</ul>
		<p>Активные маркеры отображаются зелёным.
			Для Мест и для Маршрутов активность независима.</p>
		<h2 id="3-режимы-работы">3. Режимы работы</h2>
		<p>Система имеет три режима:</p>
		<ul>
			<li>Нормальный</li>
			<li>Маршруты</li>
			<li>Линейка</li>
		</ul>
		<p>Режим определяет поведение карты и правой кнопки мыши.</p>
		<h3 id="31-нормальный-режим">3.1 Нормальный режим</h3>
		<p><strong>Работа с Местами и временными («независимыми») Точками</strong>.</p>
		<ul>
			<li>ПКМ (Правая Кнопка Мыши) по пустому месту карты — создаётся временная Точка.</li>
			<li>ПКМ по существующей Точке — всплывающая информация о координатах с возможностью скопировать их в буфер
				обмена.
			</li>
		</ul>
		<h3 id="32-режим-маршрутов">3.2 Режим маршрутов</h3>
		<p><strong>Работа с текущим Маршрутом</strong>.</p>
		<ul>
			<li>ПКМ по пустому месту карты — создание и добавление новой Точки в текущий маршрут.</li>
			<li>ПКМ по любой существующей Точке (Места, Маршрута, временной) — добавление её в маршрут.</li>
		</ul>
		<p>Точка добавляется в конец списка.</p>
		<h3 id="33-режим-линейки">3.3 Режим линейки</h3>
		<p>Линейка — служебный маршрут для измерения расстояний.</p>
		<p>Она, аналогично независимым Точкам (которые, кстати, и использует):</p>
		<ul>
			<li>не сохраняется в базе данных,</li>
			<li>живёт только в рамках сессии.</li>
		</ul>
		<p>ПКМ работает так же, как в режиме Маршрутов, но данные не сохраняются.</p>
		<p>Нужен этот режим, если вы просто захотели узнать расстояние, скажем, от одного места на карте (будь то просто
			произвольное место, или уже существующее Место или Точка Маршрута) до другого. А оттуда, например, ещё
			до Питера.
		</p>
		<p>В общем, чтобы просто посмотреть расстояние какого-то пути без необходимости заводить специальный Маршрут.
		</p>
		<h2 id="4-интерфейс">4. Интерфейс</h2>
		<p>Экран разделён на три колонки и три строки:</p>
		<h3 id="41-верхняя-панель-шапка">4.1 Верхняя панель (шапка)</h3>
		<p>Здесь находится:</p>
		<h4 id="411-левая-верхняя-область-кнопки-переключатели">4.1.1 Левая верхняя область — кнопки-переключатели:</h4>
		<ul>
			<li><strong>Места</strong>, <strong>Маршруты</strong>, <strong>Точки</strong> — при клике по этим кнопкам
				на карте
				показываются или скрываются все маркеры соответственно Мест, Маршрутов или отдельных «независимых»
				Точек;</li>
			<li><strong>Радиус</strong> — при клике по этой кнопке в левой колоке основной области ниже показывается или
				скрывается панель соответствующей «утилиты»; там можно ввести количество километров вокруг активной
				выделенной
				точки (будь то Точка Места, Точка Маршрута или независимая Точка), и на карте показываются только
				маркеры,
				находящиеся в радиусе этого количества километров;</li>
			<li><strong>Папки</strong> — переключение режима отображения Папок в деревьях Мест и маршрутов; при нажатой
				кнопке
				«Папки» вместо просто названий папок показываются поля ввода этих названий, а также поля их описаний;
			</li>
			<li><strong>Нормальный</strong>, <strong>Маршруты</strong>, <strong>Линейка</strong> — кнопки переключения
				одного
				из трёх основных режимов работы сервиса, описанных выше.</li>
		</ul>
		<h4 id="412-правая-верхняя-область-кнопки-глобальных-действий">4.1.2 Правая верхняя область — кнопки глобальных
			действий:</h4>
		<ul>
			<li><strong>Отменить</strong>, <strong>Вернуть</strong> — ГеоОрганайзер поддерживает систему «undo/redo»,
				систему
				отмены/возврата изменений;</li>
			<li><strong>Сохранить</strong> — кнопка сохранения сделанных изменений в базу данных. Изменения сохраняются
				<strong>только вручную</strong> и <strong>только по этой кнопке</strong>. Если есть несохранённые
				изменения,
				кнопка «Сохранить» активируется. При попытке выйти, не сохранив изменения, во всплывающем окне появится
				запрос
				подтверждения;
			</li>
			<li><strong>Приложение</strong> — по клике на кнопку вы сможете установить приложение ГеоОрганайзера «Места»
				к себе
				на мобильное устройство или ПК/ноутбук.</li>
			<li><strong>Экспорт</strong>, <strong>Импорт</strong> — система поддерживает импорт и экспорт точек
				в форматах GPX
				и JSON; вы можете, например, импортировать точки из вашего навигатора; или экспортировать места из
				ГеоОрганайзера в файл одного из этих форматов, чтобы скинуть их по почту другу;</li>
			<li>Справка — этот мануал;</li>
			<li>Выход — закончить рабочую сессию, разлогиниться; при этом вся ваша личная информация из памяти браузера
				(localStorage) удаляется; только из памяти браузера, не волнуйтесь, не из базы данных.</li>
		</ul>
		<h4 id="413-средняя-верхняя-область">4.1.3 Средняя верхняя область</h4>
		<p>Здесь находятся:</p>
		<ul>
			<li>Ссылка с вашим именем (или логином, если вы не указывали имя при регистрации). По клику на ней всплывает
				контекстное меню с пунктами <strong>Профиль</strong> и <strong>Выход</strong>. По ссылке «Профиль» вы
				перейдёте
				на страницу вашего аккаунта, где можно менять информацию о себе: сменить свой пароль, добавить e-mail
				или номер
				телефона и т.д. А также удалить свой аккаунт из системы :(.</li>
			<li>Выпадающий список текущего языка интерфейса. Сейчас поддерживаются только русский и английский.</li>
			<li>Выпадающий список цветовых тем интерфейса.</li>
		</ul>
		<h3 id="42-основная-область">4.2 Основная область</h3>
		<h4 id="421-левая-панель--структура">4.2.1 Левая панель — структура</h4>
		<p>Здесь отображаются:</p>
		<ul>
			<li>Строка моментального поиска по названию (или его части) Места или Маршрута. При вводе в неё в
				соответствующих
				деревьях остаются показанными только Места или Маршруты, названия которых соответствуют введёному.</li>
			<li>Поле ввода количества километров, в радиусе которого от текущей активной Точки показываются маркеры
				на карте
				(при нажатой соответствующей кнопке-переключателе, описанной выше).</li>
			<li>Панель со списком кнопок Точек «Линейки» (если вы в соответствующем режиме) и, собственно, расстоянием
				между
				ними. Эти кнопки в списке можно сортировать между собой перетаскиванием (Drag &amp; Drop).
				Соответственно, сразу
				меняется и значение расстояния этого «пути», и его отображение на карте.</li>
			<li>Список независимых, временных, Точек.</li>
			<li>Деревья Мест и Маршрутов в виде вложенных друг в друга Папок.</li>
		</ul>
		<p>В деревьях Мест и Маршрутов:</p>
		<p>При наведении на папку появляются иконки-кнопки:</p>
		<ul>
			<li>показать/скрыть геометки,</li>
			<li>добавить место/маршрут,</li>
			<li>добавить подпапку,</li>
			<li>удалить папку.</li>
		</ul>
		<p>При удалении папки можно (вас об этом спросят во всплывающем окне):</p>
		<ul>
			<li>удалить всё содержимое</li>
			<li>или перенести его в корневую папку.</li>
		</ul>
		<p>При наведении на Место или Маршрут появляются иконки-кнопки:</p>
		<ul>
			<li>показать/скрыть маркер(ы),</li>
			<li>добавить элемент после текущего,</li>
			<li>удалить.</li>
		</ul>
		<h4 id="422-правая-панель--просмотрредактирование">4.2.2 Правая панель — просмотр/редактирование</h4>
		<p>Здесь располагается подробная информация о текущем выделенном Месте и текущем выделенном Маршруте. Она
			представлена
			в большинстве своём прямо в соответствующих полях ввода, так что вы её не только видите, но и можете сразу
			изменить.
		</p>
		<p>Основныы поля:</p>
		<ul>
			<li>Название</li>
			<li>Описание</li>
			<li>Координаты — мы же помним, что сами Места и Маршруты не хранят координаты; показываются координаты
				связанной
				с Местом Точки или связанной с Маршрутом текущей активной, выделенной Точки из его списка</li>
			<li>Ссылка — ну, мало ли, может статья в Википедии об этой «библиотеке»</li>
			<li>Сортировка — число, в соответствии с которым упорядочиваются Места и Маршруты в их деревьях в левой
				колонке</li>
			<li>Видимость Места или Маршрута другим — ГеоОрганайзер поддерживает функцию «опубличивания» Мест или
				Маршрутов.
				Если поставить эту галку, другие пользователи смогут видеть это Место или Маршрут на карте, смотреть
				(но не менять, естественно!) информацию о нём</li>
			<li>Фотографии — превьюшки фотоальбома Места или Маршрута</li>
			<li>Домашнее место — эта галка отвечает за то, какое место будет выделенным, активным, при входе
				в ГеоОрганайзер;
				обычно это какое-то ваше основное место, дом, например; просто для удобства</li>
		</ul>
		<p>Изменения применяются немедленно в интерфейсе, но сохраняются в базе данных только после нажатия кнопки
			«Сохранить».
		</p>
		<h4 id="423-центральная-область-карта">4.2.3 Центральная область — карта</h4>
		<p>Поддерживаются карты OpenStreetMap и Яндекс.Карты.</p>
		<h3 id="43-нижняя-панель-подвал">4.3 Нижняя панель (подвал)</h3>
		<p>Здесь находится:</p>
		<h4 id="431-левая-нижняя-область-кнопки-переключатели">4.3.1 Левая нижняя область — кнопки-переключатели:</h4>
		<ul>
			<li><strong>Показать / скрыть все свои геометки</strong> — все маркеры Мест, независимых Точек, Точек
				Маршрутов
				на карте; иногда хочется просто поразглядывать карту</li>
			<li><strong>Показвть / скрыть все другие места</strong> — все маркеры на карте Мест других пользователей,
				которые
				они сделали «публичными», а также их список в левой колонке</li>
			<li><strong>Показвть / скрыть все другие геометки</strong> — все маркеры на карте Мест других пользователей,
				которые
				они сделали «публичными», но оставить их список в левой колонке</li>
			<li><strong>Показвть / скрыть все другие маршруты</strong> — все маркеры на карте Маршрутов других
				пользователей,
				которые они сделали «публичными»</li>
			<li><strong>Показвть / скрыть метку центра карты</strong> — это перекрестие в центре карты; оно тоже
				перетаскивается
				мышкой, а если вы «перетаскиваете» саму карту, следит за её текущим центром и «прыгает» в него; вручную
				координаты центра можно набрать числами в этом же подвале правее:</li>
		</ul>
		<h4 id="432-основная-нижняя-область">4.3.2 Основная нижняя область</h4>
		<p>Здесь располагается выпадающий список выбора карты — OpenStreetMap или Яндекс.Карты — и координаты центра
			карты.</p>
		<h2 id="5-принципы-хранения-и-порядка">5. Принципы хранения и порядка</h2>
		<h3 id="разделение-данных-и-порядка">Разделение данных и порядка</h3>
		<p>Элементы хранятся в виде объектов с доступом по ID.<br>
			Порядок отображения определяется не порядком хранения, а отдельным полем <code>srt</code>.</p>
		<p>Это обеспечивает:</p>
		<ul>
			<li>предсказуемость,</li>
			<li>устойчивость при синхронизации,</li>
			<li>корректную работу после перезагрузки,</li>
			<li>независимость от особенностей JavaScript-объектов.</li>
		</ul>
		<h3 id="явное-сохранение-изменений">Явное сохранение изменений</h3>
		<p>Система использует модель «отложенного сохранения».</p>
		<p>Изменения помечаются как изменённые (dirty), но не отправляются на сервер автоматически.<br>
			Пользователь подтверждает сохранение вручную по <strong>одной-единственной кнопке «Сохранить»</strong>
			в правом
			верхнем углу окна. И только так!</p>
		<p>Это даёт:</p>
		<ul>
			<li>контроль над транзакцией,</li>
			<li>возможность пакетных изменений,</li>
			<li>предсказуемое поведение интерфейса.</li>
		</ul>
		<h2 id="6-базовый-сценарий-работы">6. Базовый сценарий работы</h2>
		<h3 id="создание-места">Создание места</h3>
		<ol>
			<li>Создать Место. Если нажать «Добавить» у папки — Место создаётся в конце списка этой папки. Если нажать
				«Добавить» у конкретного Места — новое создаётся сразу после него. Точка создаётся автоматически в
				текущем
				центре карты.</li>
			<li>Ввести название, описание, другую информацию в правой колонке.</li>
			<li>Добавить фотографии.</li>
			<li>Нажать «Сохранить» для сохранения изменений.</li>
		</ol>
		<h3 id="создание-маршрута">Создание маршрута</h3>
		<ol>
			<li>Создать Маршрут кликом по кнопке-иконке с плюсом в заголовке дерева Маршрутов в левой колонке.</li>
			<li>Ввести название, описание, другую информацию в правой колонке, добавить фотографии.</li>
			<li>Добавить Точки (кнопкой в списке точек Маршрута в правой колонке или кликом ПКМ на пустом месте
				на карте).</li>
			<li>При необходимости поправить местоположение Точек перетаскиванием маркеров на карте.</li>
			<li>При необходимости изменить порядок Точек перетаскиванием кнопок Точек в их списке в правой колонке.</li>
			<li>Сохранить изменения.</li>
		</ol>
		<p>Точка может быть добавлена повторно — система не создаёт её дубликат.</p>
		<h3 id="работа-с-изображениями">Работа с изображениями</h3>
		<ul>
			<li>Загрузить новые изображения по кнопке «Добавить фотографии».</li>
			<li>Поддерживается Drag &amp; Drop для изменения порядка отображения превьюшек.</li>
			<li>Порядок отображения обновляется также сохраняется в базе данных.</li>
		</ul>
		<h2 id="7-архитектурные-особенности">7. Архитектурные особенности</h2>
		<ul>
			<li>Frontend: Vue 3, Pinia, Axios.</li>
			<li>Состояние централизовано.</li>
			<li>Модель данных фронтенда отражает структуру базы данных.</li>
			<li>Используется пакетная синхронизация изменений.</li>
		</ul>
		<p>Система спроектирована с учётом масштабируемости и консистентности данных.</p>
		<h3 id="удаление-и-безопасность-данных">Удаление и безопасность данных</h3>
		<p>Если удалить Место или Точку из Маршрута:</p>
		<ul>
			<li>Если соответствующая Точка больше нигде не используется — она удаляется.</li>
			<li>Если используется — остаётся.</li>
		</ul>
		<h3 id="принцип-сохранения">Принцип сохранения</h3>
		<p>Все изменения:</p>
		<ul>
			<li>добавление</li>
			<li>изменение</li>
			<li>удаление</li>
		</ul>
		<p>сначала накапливаются в памяти.</p>
		<p>Только при нажатии кнопки «Сохранить» в правой верхней области они записываются в базу данных.</p>
		<p>Это позволяет:</p>
		<ul>
			<li>работать быстро,</li>
			<li>отменять действия,</li>
			<li>контролировать момент фиксации данных.</li>
		</ul>
		<h2 id="8-текущий-статус">8. Текущий статус</h2>
		<p>Версия 6.3.3 alpha.</p>
		<p>Основной функционал стабилен:</p>
		<ul>
			<li>создание и редактирование сущностей;</li>
			<li>иерархическая организация;</li>
			<li>маршруты с упорядоченными точками;</li>
			<li>сортировка изображений;</li>
			<li>пакетное сохранение.</li>
		</ul>
		<p>Ведётся дальнейшая работа по улучшению UX и оптимизации внутренних механизмов.</p>
		<p><a href="#manual-top">Наверх</a></p>
	</div>
</template>

<style lang="scss" scoped>
ol {
	list-style-type: none;
	counter-reset: item;
}

li {
	display: block;
}

li::before {
	content: counters(item, ".") ". ";
	counter-increment: item;
}
</style>
