<template>
	<div
		class="popup-text about"
		onclick="event.stopPropagation();"
	>
		<h1 class="margin_bottom_0">Места</h1>
		<p>v5.11.5</p>
		<p>Сервис просмотра и редактирования библиотек геометок</p>
		<p><strong>Разработчик:</strong><br />Дмитрий (Assador) Соколов<br />e-mail: <a href="mailto:assador@gmail.com">assador@gmail.com</a><br />Telegram: <a href="tg://resolve?domain=Assador">@Assador</a></p>
		<h2>Оглавление</h2>
		<ul>
			<li><a href="#__RefHeading___Toc412_2631625936">Введение</a></li>
			<li><a href="#__RefHeading___Toc108_2010873736">Интерфейс</a>
				<ul>
					<li><a href="#__RefHeading___Toc110_2010873736">Элементы и их расположение</a>
						<ul>
							<li><a href="#__RefHeading___Toc112_2010873736">1 строка. Шапка.</a>
								<ul>
									<li><a href="#__RefHeading___Toc164_2344457006">Первая ячейка шапки (центральная верхняя ячейка таблицы)</a></li>
									<li><a href="#__RefHeading___Toc166_2344457006">Вторая ячейка шапки (правая верхняя ячейка таблицы)</a></li>
								</ul>
							</li>
							<li><a href="#__RefHeading___Toc168_2344457006">2 строка. Основная.</a>
								<ul>
									<li><a href="#__RefHeading___Toc204_2631625936">Первая ячейка основной области (левая центральная ячейка таблицы)</a></li>
									<li><a href="#__RefHeading___Toc206_2631625936">Вторая ячейка основной области (центральная ячейка таблицы)</a></li>
									<li><a href="#__RefHeading___Toc208_2631625936">Третья ячейка основной области (правая центральная ячейка таблицы)</a></li>
								</ul>
							</li>
							<li><a href="#__RefHeading___Toc661_2631625936">3 строка. Подвал.</a>
								<ul>
									<li><a href="#__RefHeading___Toc663_2631625936">Первая ячейка подвала (левая нижняя ячейка таблицы)</a></li>
									<li><a href="#__RefHeading___Toc665_2631625936">Вторая ячейка подвала (правая нижняя ячейка таблицы)</a></li>
								</ul>
							</li>
						</ul>
					</li>
				</ul>
			</li>
			<li><a href="#__RefHeading___Toc414_2631625936">Страница пользователя</a>
				<ul>
					<li><a href="#__RefHeading___Toc2583_2631625936">Удаление аккаунта</a></li>
				</ul>
			</li>
			<li><a href="#__RefHeading___Toc5024_2631625936">Импорт / экспорт</a></li>
		</ul>
		<h2><a id="__RefHeading___Toc412_2631625936" />Введение</h2>
		<p>Библиотека геометок «Места» — это онлайн сервис, позволяющий создавать свои коллекции мест на карте с подробной информацией о них. Собирать их вместе, сортировать по папкам, просматривать, редактировать и обмениваться с другими. Экспортировать свои (для навигаторов, например), импортировать места других людей.</p>
		<p>Идея была проста. Есть множество средств создания фотоальбомов, музыкальных плейлистов — с описаниями, возможностью сортировки, ссылками, преферансом и барышнями. А похожей полноценной свободной картографической реализации толком нет.</p>
		<p>Представьте, что вы пошли с другом в поход. Каждый у себя в навигаторе смартфона отмечал какие-то интересные места — удобные стоянки, опасные пороги, прохождение которых описывал. Потом вернулись домой, и каждый остался при своих. Сервис позволяет собрать их вместе, слив оба набора в один, отсортировать, разложить по папкам, отредактировать описания в удобном интерфейсе на компе, добавить фотографии, ссылки, сделать при желании видимыми другим пользователям сервиса, экспортировать потом, в конце концов, для использования в навигаторах и т.д.</p>
		<p>Проект свободный, постоянно развивается. Любой желающий может принять участие и делать пул-реквесты или форкать и развивать самостоятельно, создавая свои собственные сервисы. Написан на Vue.js. Сейчас проект находится здесь — <a
href="https://github.com/assador/places"
target="_blank"
>https://github.com/assador/places</a></p>
		<h2><a id="__RefHeading___Toc108_2010873736" />Интерфейс</h2>
		<h3><a id="__RefHeading___Toc110_2010873736" />Элементы и их расположение</h3>
		<p>Окно приложения представлено в виде таблицы в 3 колонки с 3 строками. Рассмотрим каждую ячейку этой таблицы.</p>
		<h4><a id="__RefHeading___Toc112_2010873736" />1 строка. Шапка.</h4>
		<h5><a id="__RefHeading___Toc164_2344457006" />Первая ячейка шапки (центральная верхняя ячейка таблицы)</h5>
		<p>В ней находятся название сервиса с подписью и ваш логин в виде ссылки. При клике по ссылке открывается окно с информацией по аккаунту («Страница пользователя»), которую можно редактировать. Оно описано ниже.</p>
		<p>В правом верхнем углу центральной части шапки расположено два выпадающих списка — с выбором языка и цветовой темы интерфейса. Сейчас доступны два языка — английский и руссккий и восемь цветовых тем — 4 тёмных и 4 светлых. Также в этом месте показываются информационные сообщения и подсказки во всплывающем черном прямоугольнике.</p>
		<h5><a id="__RefHeading___Toc166_2344457006" />Вторая ячейка шапки (правая верхняя ячейка таблицы)</h5>
		<p>В ней расположены основные управляющие кнопки самого сервиса:</p>
		<ul>
			<li>
				<p>«<strong>Отменить</strong>» (“Undo”, Alt + Shift + z). Отменить последнее действие, то есть, вернуться к предыдущему состоянию. При отмене и повторах текущее состояние не сохраняется в базу данных, так что, при необходимости нужно либо сохраниться вручную, либо произвести какое-либо действие, которое сохраняет состояние в базу.</p>
			</li>
			<li>
				<p>«<strong>Вернуть</strong>» (“Redo”, Alt + Shift + y). Если было отменено, вернуть следующее действие.</p>
			</li>
			<li>
				<p>«<strong>Сохранить</strong>» (Alt + Shift + s). Немедленно сохранить текущее состояние в базу данных.</p>
			</li>
			<li>
				<p>«<strong>Приложение</strong>». Установить сервис на текущее устройство как PWA-приложение.</p>
			</li>
			<li>
				<p>«<strong>Импорт</strong>» (Alt + Shift + i). Импортировать в текущую библиотеку другие места из файла. Подробнее об импорте / экспорте написано в разделе «Импорт / экспорт».</p>
			</li>
			<li>
				<p>«<strong>Экспорт</strong>» (Alt + Shift + e). Экспортировать места текущей библиотеки в файл. Сохраняется (в зависимости от формата файла) вся информация, включая структуру папок и информацию о картинках, кроме самих картинок. Также, подробное описание ниже.</p>
			</li>
			<li>
				<p>«<strong>Справка</strong>» (Alt + Shift + h). Собственно, эта документация.</p>
			</li>
			<li>
				<p>«<strong>Выход</strong>» (Alt + Shift + q). Разлогиниться.</p>
			</li>
		</ul>
		<h4><a id="__RefHeading___Toc168_2344457006" />2 строка. Основная.</h4>
		<h5><a id="__RefHeading___Toc204_2631625936" />Первая ячейка основной области (левая центральная ячейка таблицы)</h5>
		<h6>Управляющие кнопки мест и папок и строка поиска мест под этими кнопками. Сами кнопки:</h6>
		<ul>
			<li>
				<p>«<strong>Новое</strong>» (Alt + Shift + a). Добавляет новое место в центре карты, в конец текущей папки, той, в которой находится текущее, выделенное, место. При этом получает фокус поле ««Название»» (см. ниже).</p>
			</li>
			<li>
				<p>«<strong>Удалить</strong>» (Alt + Shift + d). Удаляет текущее, выделенное, место. Без подтверждения, поскольку в приложении реализован механизм отмены / повтора (кнопки «Отменить» и «Вернуть», см. ниже).</p>
			</li>
			<li>
				<p>«<strong>Папка</strong>» (Alt + Shift + f). Добавляет новую папку в конец текущей папки, той, в которой находится текущее, выделенное, место. При этом всплывает окно с полями ввода названия и описания создаваемой папки и кнопками «Создать папку» и «Закрыть». Последняя нужна потому, что при создании новой папки это окно не закрывается, чтобы было удобнее создавать сразу несколько папок, не кликая каждый раз по кнопке «Добавить папку».</p>
			</li>
			<li>
				<p><a id="__DdeLink__189_2631625936" />«<strong>Папки</strong>» (Alt + Shift + c). Приложение переходит в режим редактирования папок. При этом каждая строка папки (дерево геометок, см. описание ниже) заменяется на поле ввода названия папки, и поле ввода её описания. В правой части поля названия расположен крестик, при клике по которому всплывает окно с параметрами удаления этой папки. В этом окне 2 переключателя: «Оставить содержимое в корне» и «Удалить содержимое». Ну и кнопки «Удалить папку» и «Отмена». При удалении папки, если выбран переключатель «Оставить содержимое в корне», то всё содержимое удаляемой папки не удаляется вместе с ней, а просто переносится в корень дерева. Если же выбран переключатель «Удалить содержимое», то, очевидно, всё, что находится внутри удаляемой папки, удаляется вместе с ней. При всём при этом по-прежнему действует механизм отмены / повтора. Так что, даже если вы удалили папку со всем содержимым, всё это обратимо.</p>
			</li>
			<li>
				<p>«<strong>В радиусе</strong>» (Alt + Shift + r). Оставляет в меню и на карте только те места, которые находятся на указанном в километрах радиусе от текущего места.</p>
			</li>
			<li>
				<p>«<strong>Измерить</strong>» (Alt + Shift + m). Переходит в режим вычисления расстояния между выделенными местами. После нажатия на кнопку нужно последовательно выбирать места правой кнопкой мыши либо в меню, либо на карте. При этом вычисляется расстояние между этими местами, в той же последовательности, в которой они выбраны, расстояние пути по всем этим местам. Эту последовательность можно менять, перетаскивая эти места в списке. Также, каждое место можно заменить на другое, кликнув на кнопку со стрелкой напротив этого места в списке и выбрав другое. Можно также удалить каждое место из списка, кликнув на кнопку с крестиком, либо кликнув правой кнопкой мыши на это выбранное место в меню или на карте.</p>
			</li>
		</ul>
		<p>Поле поиска. Регистр букв не учитывается. После нажатия кнопки «Искать» в меню остаются только места, удовлетворяющие поиску. Кнопка «Очистить» вновь возвращает в меню все места.</p>
		<h6>Основное дерево мест; меню.</h6>
		<p>Сами кнопки мест располагаются во вложенных друг в друга папках. Корневая папка — «Мои места». При клике на папке она открывается / закрывается; при клике на место оно становится активным на карте, и в правой колонке показывается вся информация о нём.</p>
		<p>Редактировать можно как сами места, так и папки. Места, очевидно, редактируются на карте и в правой колонке, о чём ниже, а папки по нажатию кнопки «<strong>Редактировать папки</strong>» (Alt + Shift + c), о чём было сказано выше.</p>
		<p>Как сами кнопки мест, так и папки можно перетаскивать, сортируя их порядок и вложенность. Можно перетащить место в другую папку, папку в папку и т.д.</p>
		<h5><a id="__RefHeading___Toc206_2631625936" />Вторая ячейка основной области (центральная ячейка таблицы)</h5>
		<p>Это, собственно, карта. Сейчас она реализована двумя сервисами: <a
href="https://www.openstreetmap.org/"
target="_blank"
>OpenStreetMap</a> и <a
href="https://maps.yandex.ru/"
target="_blank"
>Яндекс.Карты</a>. Это обычные карты этих провайдеров, настроенные для работы в сервисе.</p>
		<p>При клике на метку места оно становится активным, текущим, показывается его описание, как и при клике на место в меню слева. При клике на метку места правой кнопкой мыши в шапке всплывает сообщение (и остаётся, пока по нему не кликнешь) с координатами и описанием этого места. Метки можно перетаскивать (свои метки; «общие», не ваши — нет, о чём ниже). При этом, естественно, меняется информация о широте / долготе / высоте этого места.</p>
		<h5><a id="__RefHeading___Toc208_2631625936" />Третья ячейка основной области (правая центральная ячейка таблицы)</h5>
		<p>Это область с информацией о месте. В ней расположены следующие поля:</p>
		<ul>
			<li>
				<p><span>«</span><strong>Название</strong><span>»</span><span>.</span> Название места. Сервис «реактивен», то есть, при вводе текста он одновременно меняется и на кнопке места, и в подсказке Яндекс.Карт. То же относится вообще практически ко всему в сервисе. Например, при изменении широты / долготы передвигается метка на карте и т.д.</p>
			</li>
			<li>
				<p>«<strong>Описание</strong>». Очевидно, описание места.</p>
			</li>
			<li>
				<p><a id="__DdeLink__379_2631625936" />«<strong>Широта</strong>». Географическая широта это места.</p>
			</li>
			<li>
				<p>«<strong>Долгота</strong>». Географическая долгота это места.</p>
			</li>
			<li>
				<p>«<strong>Координаты в минутах и секундах</strong>». Собственно, те же широта и долгота, но дробная часть градусов в минутах и секундах. Эти координаты взаимосвязаны с описанными выше. Если изменить здесь, изменятся с дробной частью. И наоборот.</p>
			</li>
			<li>
				<p>«<strong>Высота над уровнем моря (м)</strong>». Высота места над уровнем моря в метрах. Рассчитывается автоматически в зависимости от координат.</p>
			</li>
			<li>
				<p>«<strong>Ссылка</strong>». Ссылка на какой-либо внешний ресурс, связанный с этим местом. Например, сайт бара, добавленного вами в вашу библиотеку мест, чтобы не забыть, где он располагается, когда вы там находитесь.</p>
			</li>
			<li>
				<p>«<strong>Время создания геометки (UTC)</strong>». Время создания геометки места в формате <a
					href="https://ru.wikipedia.org/wiki/%D0%92%D1%81%D0%B5%D0%BC%D0%B8%D1%80%D0%BD%D0%BE%D0%B5_%D0%BA%D0%BE%D0%BE%D1%80%D0%B4%D0%B8%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5_%D0%B2%D1%80%D0%B5%D0%BC%D1%8F"
					target="_blank"
				>всемирного координированного времени</a>. Обычно автоматически выставляется в навигаторах. Если добавляете место в сервисе, тоже ставится автоматически.</p>
			</li>
			<li>
				<p><a id="__DdeLink__395_2631625936" />«<strong>Сортировка</strong>». Местоположение кнопки места среди своих собратьев в дереве мест. Возможны дробные значения. К примеру, в дереве идут по порядку сверху вниз следующие кнопки: «Мой дом» (значение сортировки: 1), «Дом любовницы» (значение сортировки: 1.5), «КВД» (значение сортировки: 2).</p>
			</li>
			<li>
				<p>«<strong>Место видно другим</strong>». Переключатель, отвечающий за то, могут ли другие пользователи сервиса видеть это место и информацию о нём (функционал «общих мест»).</p>
			</li>
			<li>
				<p><a id="__DdeLink__539_2631625936" />«<strong>Фотографии</strong>». У каждого места может быть свой фотоальбом. Вы можете загружать фотографии (и не только; поддерживаются типы image/gif, image/jpeg, image/png, image/svg+xml), просматривать, листая, в полном размере, сортировать их, удалять. Планируется добавить возможность загрузки аудио- и видеофайлов. В этой области показываются миниатюры загруженных к этому месту картинок. Их можно перетаскивать, меняя их порядок. В правом верхнем углу каждой миниатюры находится круглая кнопка с крестиком, по клику на которой картинка удаляется без подтверждения. При клике по самой миниатюре картинка открывается в полный размер. При клике по картинке, открытой в полном размере, показывается следующая картинка. Слева и справа от картинок, открытых в полном размере, есть также стрелки для показа предыдущей / следующей картинки. Под областью с миниатюрами есть кнопка «Добавить фотографии». Вы можете загружать сразу несколько картинок, выбрав их в открывающемся диалоге со списком файлов.</p>
			</li>
			<li>
				<p>«<strong>Домашнее место</strong>». Это переключатель, просто позволяющий сделать это место тем, которое будет активным при следующем заходе на сервис.</p>
			</li>
		</ul>
		<h4><a id="__RefHeading___Toc661_2631625936" />3 строка. Подвал.</h4>
		<h5><a id="__RefHeading___Toc663_2631625936" /><a id="__DdeLink__642_2631625936" /> Первая ячейка подвала (левая нижняя ячейка таблицы)</h5>
		<p>В ней находятся кнопки-переключатели, отвечающие за видимость разных типов меток на карте:</p>
		<ul>
			<li>
				<p>«<strong>Мои метки</strong>». Включена по-умолчанию и показывает / скрывает метки ваших мест на карте. Ну, мало ли. Может, вы решили отдохнуть и просто полюбоваться реками и озёрами Земли.</p>
			</li>
			<li>
				<p><a id="__DdeLink__542_2631625936" /><a id="__DdeLink__544_2631625936" /> «<strong>Чужие места</strong>». В сервисе регистрируются и пользуются им много людей. У каждого есть своя библиотека мест (или несколько — человек может завести несколько аккаунтов: один аккаунт — одна библиотека; кстати говоря, архитектура спорная; планируется добавить возможность заводить несколько библиотек в одном аккаунте). Так вот, в сервисе предусмотрен функционал «общих мест» — возможность делать какие-либо свои места видимыми всем другим пользователям (опять же, планируется добавить возможность «расшаривать» свои места не для всех, а лишь для определённых пользователей). Разумеется, другие пользователи не могут менять информацию об этих местах, перетаскивать метки и т.д. Они могут просто видеть их, смотреть фотографии, читать названия / описания и пр. Эта кнопка-переключатель позволяет показывать / скрывать места, помеченные другими пользователями как видимые другим.</p>
			</li>
			<li>
				<p>«<strong>Чужие метки</strong>». Показывает / скрывает геометки мест, помеченных другими пользователями как видимые другим, на карте. При этом как кнопки этих мест в дереве слева, так и информация об этих местах остаются доступными.</p>
			</li>
			<li>
				<p>«<strong>Центр карты</strong>». Показывает / скрывает крестик на карте, обозначающий текущий видимый центр карты. Его, как и геометки можно перетаскивать. Он нужен в основном для добавления новых мест. Новое место добавляется на месте этого крестика.</p>
			</li>
		</ul>
		<h5><a id="__RefHeading___Toc665_2631625936" />Вторая ячейка подвала (правая нижняя ячейка таблицы)</h5>
		<p>Здесь находятся выпадающий список провайдера карты и географические координаты текущего видимого центра карты, которые можно посмотреть или задать самому. Может, вы захотите узнать координаты странного домика, на который сейчас смотрите, или у вас есть точные координаты засекреченного объекта (того же бара), и вы хотите посмотреть на него с высоты орбиты Земли…</p>
		<h2><a id="__RefHeading___Toc414_2631625936" />Страница пользователя</h2>
		<p>Страница с информацией об аккаунте. Здесь можно посмотреть и поменять при желании:</p>
		<ul>
			<li>
				<p>«<strong>Логин</strong>». Логин, идентификатор учётной записи, с которым вместе с паролем вы авторизуетесь на сервисе. Обязательное поле.</p>
			</li>
			<li>
				<p><a id="__DdeLink__2370_2631625936" />«<strong>Новый пароль</strong>». Если возникло желание изменить пароль, с которым вы авторизуетесь на сервисе, в этом поле нужно ввести новый пароль.</p>
			</li>
			<li>
				<p>«<strong>Повторите новый пароль</strong>». Для изменения пароля в этом поле нужно повторно ввести новый пароль, во избежание ошибки.</p>
			</li>
			<li>
				<p>«<strong>Обращение (имя)</strong>». Это не логин, а именно то, как вы хотите, чтобы другие пользователи сервиса знали, как к вам обращаться. Вася Полиграфович Пупкин, например. Не обязательное поле.</p>
			</li>
			<li>
				<p>«<strong>e-mail</strong>». Адрес вашей электронной почты. На этот адрес будут приходить запросы на подтверждение некоторых действий. Например, ссылка на восстановление пароля, буде вы его забудете. Так что важно указывать реальный e-mail. Обязательное поле.</p>
			</li>
			<li>
				<p>«<strong>Телефон</strong>». Номер вашего телефона. Не обязательное поле.</p>
			</li>
		</ul>
		<p>Внизу три кнопки:</p>
		<ul>
			<li>
				<p>«<strong>Сохранить</strong>». При нажатии вам будет выслано письмо на указанный вами адрес электронной почты со ссылкой на подтверждение вносимых вами изменений, после перехода по которой изменения вступят в силу.</p>
			</li>
			<li>
				<p>«<strong>Назад</strong>». Вернуться в главный интерфейс сервиса без сохранения изменений.</p>
			</li>
			<li>
				<p>«<strong>Удалить аккаунт</strong>». Кнопка для удаления текущего аккаунта. После нажатия на неё всплывёт окно, в котором вы сможете указать, что делать с существующей библиотекой. Об этом следующий раздел.</p>
			</li>
		</ul>
		<h3><a id="__RefHeading___Toc2583_2631625936" />Удаление аккаунта</h3>
		<p>По кнопке со страницы пользователя можно удалить текущий аккаунт. В этом всплывающем окне будет предложено выбрать, что делать с существующей библиотекой — местами и фотографиями.</p>
		<p>В первой группе «Места» три переключателя:</p>
		<ul>
			<li>
				<p>«<strong>Удалить все мои места</strong>». При удалении аккаунта также будут удалены все места библиотеки.</p>
			</li>
			<li>
				<p>«<strong>Оставить только видимые всем места</strong>». При удалении аккаунта будут оставлены места, отмеченные как видимые другим пользователям, кои и останутся им видимы. Остальные места будут удалены.</p>
			</li>
			<li>
				<p>«<strong>Оставить все мои места, сделав их видимыми всем</strong>». При удалении аккаунта все места сохранятся и станут видимы другим пользователям.</p>
			</li>
		</ul>
		<p>Во второй группе «Фотографии» два переключателя: «<strong>Удалить мои фотографии</strong>» и «<strong>Оставить мои фотографии</strong>». При удалении аккаунта фотографии, соответственно, удаляются или сохраняются.</p>
		<p>После нажатия на кнопку «Удалить аккаунт» аккаунт будет удалён.</p>
		<h2><a id="__RefHeading___Toc5024_2631625936" />Импорт / экспорт</h2>
		<p>Сервис позволяет импортировать места в файл и экспортировать места из файла. В зависимости от формата файла импорт и экспорт имеет свои особенности:</p>
		<ul>
			<li>
				<p><strong>GPX</strong>. Стандартный XML-формат хранения и обмена данными GPS. Понимается большинством программ-навигаторов (например, Locus Map, Navitel и т.д.). Импортируются и экспортируются только сами места. Дерево папок не сохраняется. Фотоальбомы тоже. Из информации о месте сохраняются название, описание, ссылка, широта, долгота, высота над уровнем моря и время создания геометки. При импорте из GPX-файла, поскольку формат не хранит деревья, места импортируются в создаваемую папку «Импортированное», в которой находятся в виде дерева подпапки по текущей дате импорта. Например: «Импортированное → 2021 → 07 → 23 → [места]». Если папка «Импортированное» уже существует, то дерево даты с местами импортируется уже в неё.</p>
			</li>
			<li>
				<p><a id="__DdeLink__3100_2631625936" /><a id="__DdeLink__3109_2631625936" /> <strong>JSON</strong>. Формат хранения и обмена произвольными данными, основанный на JavaScript. Идеально подходит для обмена данными пользователей этого сервиса. Импортируются и экспортируются как сами места со всей своей информацией, так и деревья папок. Фотоальбомы пока хранят лишь некоторые данные об изображениях: ID, имя файла, размер файла, тип файла, время последнего изменения, сортировка в фотоальбоме и привязка к месту. В дальнейшем, возможно, опционально будут сохраняться сами изображения в формате Base64. При импорте из JSON-файла места по возможности встраиваются в существующее дерево мест. Если в существующем дереве есть папка с тем же ID, что и указанное как родительское у импортируемого места, то это место помещается в неё. Если нет, то для места создаётся то дерево родительских папок, которое есть в импортируемом файле.</p>
			</li>
		</ul>
	</div>
</template>
